//#include <iostream>
//#include<windows.h>
//
//using namespace std;
//
//int main()
//{
//    SetConsoleCP(1251);
//    SetConsoleOutputCP(1251);
//
//    // 1.Дано сторони трикутника.Визначити якого вигляду це трикутник(рівносторонній, рівнобедрений, прямокутний).
//
//    //int a, b, c;
//    //cout << "Введіть сторони трикутника" << endl;
//    //cin >> a >> b >> c;
//
//    //cout << a << b << c;
//
//    //if (a == b == c) {
//    //    cout << "Трикутник рівносторонній" << endl;
//    //}
//    //else if (a == b || b == c || c == a) {
//    //    cout << "Трикутник рівнобедрений" << endl;
//    //}
//
//    //else if (a * a + b * b == c * c || a * a + c * c == b * b || b * b + c * c == a * a) {
//    //    cout << "Трикутник прямокутний" << endl;
//    //}
//
//    // 2.Дано розміри цегли і отвору у стіні.Визначити чи цегла пройде у отвір.
//
//    //int gapA, gapB, gapC;
//    //int brickA, brickB, brickC;
//    //
//    //cout << "Введіть дані отвору: ";
//    //cin >> gapA >> gapB >> gapC;
//
//    //cout << "Введіть дані цеглини: ";
//    //cin >> brickA >> brickB >> brickC;
//
//    //if (gapA == brickA && gapB == brickB && gapC == brickC)
//    //{
//    //    cout << "Цеглина підходить!" << endl;
//    //}
//    //else {
//    //    cout << "Цеглина не підходить!" << endl;
//    //}
//
//    // 3.Дано 3 числа.Визначити чи є серед них додатні.
//
//    //int a, b, c, d, e;
//
//    //cout << "Ведіть числа: ";
//    //cin >> a >> b >> c >> d >> e;
//
//    //if (a >= 0 && b >= 0 && c >= 0 && d >= 0 && e >= 0) {
//    //    cout << "Всі числа додатні";
//    //}
//    //else {
//    //    cout << "Серед чисел є відємні";
//    //}
//
//    // 4.Дано число.Визначити чи лежить воно за межами відрізків[2, 5] та[-1, 1].
//
//    //int num;
//    //cout << "Введіть число: ";
//    //cin >> num;
//
//    //if ((num < 2 || num > 5) && (num < -1 || num > 1)) {
//    //    cout << "Число за межами!";
//    //}
//    //else {
//    //    cout << "Число в межах відрізків!";
//    //}
//
//    // 5.Дано три числа.Визначити чи рівні вони між собою.
//
//    int a, b, c;
//
//    cout << "Введіть три числа: ";
//    cin >> a >> b >> c;
//
//    if (a == b && b == c) {
//        cout << "Три числа рівні між собою." << endl;
//    }
//    else {
//        cout << "Три числа не рівні між собою." << endl;
//    }
//}
