#include <iostream>
#include<windows.h>

using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    //Switch
    //    1.Дано символ, який означає час(теперішній, майбутній, минулий).Вивести дієслово “вчити” у відповідному часі.
    
    cout << "hell"
    
    //    2.Написати програму яка пропонує ввести три оцінки з клавіатури
    //    (від 2 до 5) підраховує середній бал.Якщо середній бал рівний 2, тоді виводиться BAD, 3 - SO - SO, 4 - GOOD, 5 - EXCELLENT.
    // Примітка!Значення оцінок являються перелічуваними константами.
    
    
    
    //    3.Написати програму, яка переводить введену користувачем довжину в сантиметри у інші одиниці довжини за вибором користувача(метри, дециметри, міліметри).
    // Примітка!Роботу задачі організувати через систему меню
    
    
    
    //    While
    //    1.Вивести на екран цілі числа від 1 до 100. - while
    
    
    
    //    2.Вивести на екран додатні парні числа, які не перевищують 200,
    //    та їх кількість. - while
    
    
    
    //    3.Дано N(N > 0).Вводяться N чисел.Знайти суму парних серед цих чисел. - while
    
    
    
    //    4.Вводяться 10 чисел.Знайти суму та середнє арифметичне цих чисел. - while
    
    
    
    //    5.Скласти програму обчислення суми квадратів перших n - непарних чисел.Вивести на екран, крім суми квадратів і самі непарні числа і їх квадрати. - do..while
    
    
    
    //    6.Вивести на екран цілі числа : 100 99 98 97...3 2 1. - do..while
    
    
    
    //    7.Написати програму яка обчислює суму семи чисел, які вводяться з клавіатури. - do..while
    
    
    
    //    8.Вивести на екран цілі числа від 14 до 123. - while
    
    
    
    //    9.Вивести на екран додатні непарні числа, які не перевищують 100. - while









}