//#include <iostream>
//
//using namespace std;
//
//void main()
//{
//	/*
//	1. Дана діагональ телевізора в дюймах. Написати програму,
//що визначає цю ж діагональ у сантиметрах (1 дюйм =
//2.54 сантиметрів).
//Нижче представлений приклад для перевірки програ-
//ми на коректність.
//Вхідними даними є:
//Діагональ телевізора (inch) - > 42
//	*/
//
//	// int d;
//	// cout << "Enter inch: ";
//	// cin >> d;
//	// const float sm = 2.54;
//
//	// int res = d * sm;
//
//	// cout << "The length of the TV: " << res << " sm.\n\n";
//
//	/*
//	4. За один день хомʼячок зʼїдає К грам корму. Написати
//програму, що визначає закупівлю корму в кілограмах
//на 30 днів.
//Нижче представлений приклад для перевірки програ-
//ми на коректність.
//Вхідними даними є:
//Витрата корму за 1 день (г) -> 20
//	*/
//
//	//int gm;
//	//cout << "Feed consumption for 1 day: ";
//	//cin >> gm;
//	//const int day = 30;
//
//	//float result = gm * day / 1000.0;
//
//	//cout << "Consumption per month in " << result << " kg.";
//
//	/*Завдання3 Таблиця*/
//
//	cout << "================================================================================="<< endl;
//	cout << "|\tX\t|\tY\t|\tX AND Y\t|\tX OR Y\t|\tNOT X\t|" << endl;
//	cout << "=================================================================================" << endl;
//
//	cout << "|\t0\t|\t0\t|\t0\t|\t0\t|\t1\t|" << endl;
//	cout << "|\t0\t|\t1\t|\t0\t|\t1\t|\t1\t|" << endl;
//	cout << "|\t1\t|\t0\t|\t0\t|\t1\t|\t0\t|" << endl;
//	cout << "|\t1\t|\t1\t|\t1\t|\t1\t|\t0\t|" << endl;
//
//
//	cout << "=================================================================================" << endl;
//
//
//}
