//#include <iostream>
//#include<windows.h>
//
//using namespace std;
//
//int main()
//{
//    SetConsoleCP(1251);
//    SetConsoleOutputCP(1251);
//
//    //1.Дано сторони прямокутника.Визначити чи прямокутник є квадратом.
//
//    //int width, height;
//
//    //cout << "Введіть ширину і висоту прямокутника: ";
//    //cin >> width >> height;
//
//    //if (width == height) {
//    //    cout << "Прямокутник є квадратом." << endl;
//    //}
//    //else {
//    //    cout << "Прямокутник не є квадратом." << endl;
//    //}
//
//    //2.Дано вік дитини.Виначити чи дитина по віку може навчатися у школі, чи може відвідувати дитсадок і т.і.
//
//    //int age;
//
//    //cout << "Введіть вік дитини: ";
//    //cin >> age;
//
//    //if (age <= 0) {
//    //    cout << "Дитини ще нема!";
//    //}
//    //else if (age <= 5) {
//    //    cout << "Дитина може відвідувати дитячий садок." << endl;
//    //}
//    //else if (age < 17) {
//    //    cout << "Дитина може навчатися у школі." << endl;
//    //}
//    //else if (age > 17) {
//    //    cout << "Дитина вже застаріла для школи." << endl;
//    //}
//
//    //3.Дано 3 числа.Визначити чи рівно два серед них від’ємні.
//
//    //int a, b, c;
//
//    //cout << "Введіть три числа: ";
//    //cin >> a >> b >> c;
//
//    //if ((a < 0 && b < 0) || (a < 0 && c < 0) || (b < 0 && c < 0)) {
//    //    cout << "Два серед трьох чисел є від'ємними." << endl;
//    //}
//    //else {
//    //    cout << "Два серед трьох чисел не є від'ємними." << endl;
//    //}
//
//    //4.Дано число.Визначити чи належить воно відрізку[2, 5] або[-1, 1].
//
//    //int num;
//    //cout << "Введіть число: ";
//    //cin >> num;
//
//    //if ((num < 2 || num > 5) && (num < -1 || num > 1)) {
//    //    cout << "Число за межами!";
//    //}
//    //else {
//    //    cout << "Число в межах відрізків!";
//    //}
//
//    //5.Дано три числа.Визначити чи тільки два з них рівні між собою.
//
//    //int a, b, c;
//    //int count = 0;
//
//    //cout << "Введіть три числа: ";
//    //cin >> a >> b >> c;
//
//    //if (a == b) {
//    //    count++;
//    //}
//    //if (a == c) {
//    //    count++;
//    //}
//    //if (b == c) {
//    //    count++;
//    //}
//
//    //if (count == 1) {
//    //    cout << "Тільки два з них рівні між собою." << endl;
//    //}
//    //else {
//    //    cout << "Не тільки два з них рівні між собою." << endl;
//    //}
//
//    //6.Дано 3 числа.Визначити чи всі числа непарні.Числа вводяться з клавіатури
//
//    //int a, b, c;
//
//    //cout << "Введіть три числа: ";
//    //cin >> a >> b >> c;
//
//    //if (a % 2 != 0 && b % 2 != 0 && c % 2 != 0) {
//    //    cout << "Усі числа є непарними." << endl;
//    //}
//    //else {
//    //    cout << "Не всі числа є непарними." << endl;
//    //}
//
//    //На додаткові 12 балів(за бажанням) :
//    //7.Дано два числа.Якщо вони різні, то поміняти іх місцями.
//
//    //int num1, num2;
//
//    //cout << "Введіть числа: ";
//    //cin >> num1 >> num2;
//
//    //if (num1 != num2) {
//    //    int temp = num1;
//    //    num1 = num2;
//    //    num2 = temp;
//    //}
//    //cout << num1 << ' ' << num2;
//
//    //8.Дано натуральне число а(100 < 999).
//    // Напишіть програму, що визначає кількість цифр в цьому числі, суму його цифр, і яка виводить на екран першу и останню цифру через два пропуски.
//
//    //int num;
//    //int count = 0;
//    //int summa = 0;
//    //int firstNum = 0;
//
//    //cout << "Введіть число: ";
//    //cin >> num;
//
//    //int num1 = num / 100;
//    //int num2 = num % 100 / 10;
//    //int num3 = num % 10;
//
//    //if (num2) {
//    //    count++;
//    //    summa = summa + num2;
//    //    firstNum = num2;
//    //}
//
//    //if (num1) {
//    //    count++;
//    //    firstNum = num1;
//    //    summa = summa + num1;
//    //}
//
//    //if (num3) {
//    //    count++;
//    //    summa = summa + num3;
//    //}
//
//    //cout << "Кількість цифр: " << count << endl;
//    //cout << "Сума чисел = " << summa << endl;
//    //if (firstNum) {
//    //    cout << firstNum << "  " << num3;
//    //}
//
//    //9.Дано час(години, хвилини, секунди).Визначити чи час допустимий(наприклад, 25.61.60 – недопустимий).
//
//    //int hours, minutes, seconds;
//
//    //cout << "Введіть години, хвилини та секунди: ";
//    //cin >> hours >> minutes >> seconds;
//
//    //if (hours >= 0 && hours <= 23 && minutes >= 0 && minutes <= 59 && seconds >= 0 && seconds <= 59) {
//    //    cout << "Час допустимий." << endl;
//    //}
//    //else {
//    //    cout << "Час недопустимий." << endl;
//    //}
//
//    //10.Написати програму яка в залежності від введеної години виводить : good night, good day, good evening, good morning.
//
//    //int hour;
//
//    //cout << "Введіть годину: ";
//    //cin >> hour;
//
//    //if (hour >= 0 && hour < 6) {
//    //    cout << "good night" << endl;
//    //}
//    //else if (hour >= 6 && hour < 12) {
//    //    cout << "good morning" << endl;
//    //}
//    //else if (hour >= 12 && hour < 18) {
//    //    cout << "good day" << endl;
//    //}
//    //else if (hour >= 18 && hour <= 23) {
//    //    cout << "good evening" << endl;
//    //}
//    //else {
//    //    cout << "Невірний формат години." << endl;
//    //}
//
//    //11.Написати програму, яка обчислює та виводить мінімум з трьох введених користувачем чисел(з використанням тернарного оператора)
//
//    int num1, num2, num3, minNumber;
//
//    cout << "Введіть три числа: ";
//    cin >> num1 >> num2 >> num3;
//
//    minNumber = (num1 < num2) ? (num1 < num3 ? num1 : num3) : (num2 < num3 ? num2 : num3);
//
//    cout << "Мінімальне число: " << minNumber << endl;
//
//
//
//
//
//
//
//
//
//
//
//
//}
