#include <iostream>
#include<windows.h>

using namespace std;


int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    
	//1.Оголосити одновимірний масив з 10 елементів типу int.
    // Заповнити його значеннями з клавіатури, вивести на екран та 
    // підрахувати добуток елементів масиву
    
    //int arr[10];
    //int sum = 0;
    //for (int i = 0; i < 10; i++)
    //{   
    //    cout << "Ведіть число " << i + 1 << ": ";
    //    cin >> arr[i];
    //    sum *= arr[i];
    //}

    //cout << sum << endl;
    
    //2.Оголосити одновимірний масив з 7 елементів типу int.
    // Заповнити його випадковими значеннями в діапазоні[-12.. + 50] 
    // та вивести на екран.
    // Підрахувати кількість відємних та додатніх елементів масиву.
    
    //int arr[7]{ -1,2,-3,4,-5,6,-7 };
    //int positive = 0;
    //int negative = 0;

    //for (int i = 0; i < 7; i++)
    //{
    //    if (arr[i] > 0)
    //    {
    //        positive++;
    //    }
    //    else if (arr[i] < 0) {
    //        negative++;
    //    }
    //}

    //cout << "Позитивні = " << positive << endl << "Негативні = " << negative << endl;
    

    //3.Оголосити, проініціалізувати початковими значеннями та вивести 
    // одновимірний масив з 7 елементів типу long.Визначити суму парних елементів масиву
    
    //long arr[7]{ 113,524,13,13,5,521,1 };
    //long sum = 0;

    //for (int i = 0; i < 7; i++)
    //{
    //    if (arr[i] % 2 == 0)
    //    {
    //        sum += arr[i];
    //    }
    //}

    //cout << "Сумма елементів = " << sum;
    
    //4.Утворити одновимірний масив розміром 30. 
    // Заповнити його числами, які є степенями 2: (1, 2, 4, 8, 16, ...).
    // Вивести елементи масиву на екран у прямому і оберненому порядку.
    
    //long arr[30];

    //for (int i = 0; i < 30; i++)
    //{
    //    if (arr[0] != 1)
    //    {
    //        arr[i] = 1;
    //        continue;
    //    }

    //    arr[i] = arr[i - 1] * 2;
    //}

    //for (int i = 0; i < 30; i++)
    //{
    //    cout << arr[i] << ", ";
    //}

    //cout << endl;
    //cout << endl;
    //cout << endl;

    //for (int i = 29; i >= 0; i--)
    //{
    //    cout << arr[i] << ", ";
    //}
    
    //5.Дано одновимірний масив.Замінити всі від’ємні елементи їх модулями.

    int arr[10]{ 1,-2,4,6,-5,-8,2,6,1,5 };

    for (int i = 0; i < 10; i++)
    {
        if (arr[i] < 0)
        {
            arr[i] = -arr[i];
        }
    }

    for (int i = 0; i < 10; i++)
    {
        cout << arr[i] << ", ";
    }








}